modm-ext/data.modm.io/docs/svd/header_stm32u585xx.svd
        <register>
          <name>WPR24</name>
          <description>SRAM Write Protection Register 2</description>
          <addressOffset>0xdc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>P32WP</name>
              <description>Write Protection Page 32</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P33WP</name>
              <description>Write Protection Page 33</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P34WP</name>
              <description>Write Protection Page 34</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P35WP</name>
              <description>Write Protection Page 35</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P36WP</name>
              <description>Write Protection Page 36</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P37WP</name>
              <description>Write Protection Page 37</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P38WP</name>
              <description>Write Protection Page 38</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P39WP</name>
              <description>Write Protection Page 39</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P40WP</name>
              <description>Write Protection Page 40</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P41WP</name>
              <description>Write Protection Page 41</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P42WP</name>
              <description>Write Protection Page 42</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P43WP</name>
              <description>Write Protection Page 43</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P44WP</name>
              <description>Write Protection Page 44</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P45WP</name>
              <description>Write Protection Page 45</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P46WP</name>
              <description>Write Protection Page 46</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P47WP</name>
              <description>Write Protection Page 47</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P48WP</name>
              <description>Write Protection Page 48</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P49WP</name>
              <description>Write Protection Page 49</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P50WP</name>
              <description>Write Protection Page 50</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P51WP</name>
              <description>Write Protection Page 51</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P52WP</name>
              <description>Write Protection Page 52</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P53WP</name>
              <description>Write Protection Page 53</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P54WP</name>
              <description>Write Protection Page 54</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P55WP</name>
              <description>Write Protection Page 55</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P56WP</name>
              <description>Write Protection Page 56</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P57WP</name>
              <description>Write Protection Page 57</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P58WP</name>
              <description>Write Protection Page 58</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P59WP</name>
              <description>Write Protection Page 59</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P60WP</name>
              <description>Write Protection Page 60</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P61WP</name>
              <description>Write Protection Page 61</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P62WP</name>
              <description>Write Protection Page 62</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P63WP</name>
              <description>Write Protection Page 63</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ECCKEY4</name>
          <description>SRAM ECC Key Register</description>
          <addressOffset>0xe4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>ERKEYR4</name>
          <description>SRAM Erase Key Register</description>
          <addressOffset>0xe8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ERASEKEY</name>
              <description>Erase Write Protection Key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
