modm-ext/data.modm.io/docs/svd/header_stm32u585xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="RAMCFG_BKPRAM">
      <name>RAMCFG_BKPRAM_S</name>
      <description>SRAMs configuration controller</description>
      <baseAddress>0x50026100</baseAddress>
    </peripheral>
    <peripheral derivedFrom="DMA2D">
      <name>DMA2D_S</name>
      <description>DMA2D Controller</description>
      <baseAddress>0x5002b000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="ICACHE">
      <name>ICACHE_S</name>
      <description>Instruction Cache</description>
      <baseAddress>0x50030400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="DCACHE1">
      <name>DCACHE1_S</name>
      <description>Data Cache</description>
      <baseAddress>0x50031400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GTZC_TZSC1">
      <name>GTZC_TZSC1_S</name>
      <description>Global TrustZone Controller</description>
      <baseAddress>0x50032400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GTZC_TZIC1">
      <name>GTZC_TZIC1_S</name>
      <baseAddress>0x50032800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GTZC_MPCBB1">
      <name>GTZC_MPCBB1_S</name>
      <baseAddress>0x50032c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GTZC_MPCBB1">
      <name>GTZC_MPCBB2_S</name>
      <baseAddress>0x50033000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GTZC_MPCBB1">
      <name>GTZC_MPCBB3_S</name>
      <baseAddress>0x50033400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOA_S</name>
      <description>General Purpose I/O</description>
      <baseAddress>0x52020000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOB_S</name>
      <description>General Purpose I/O</description>
      <baseAddress>0x52020400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOC_S</name>
      <description>General Purpose I/O</description>
      <baseAddress>0x52020800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOD_S</name>
      <description>General Purpose I/O</description>
      <baseAddress>0x52020c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOE_S</name>
      <description>General Purpose I/O</description>
      <baseAddress>0x52021000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOF_S</name>
      <description>General Purpose I/O</description>
      <baseAddress>0x52021400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOG_S</name>
      <description>General Purpose I/O</description>
      <baseAddress>0x52021800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOH_S</name>
      <description>General Purpose I/O</description>
      <baseAddress>0x52021c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOI_S</name>
      <description>General Purpose I/O</description>
      <baseAddress>0x52022000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="ADC1">
      <name>ADC1_S</name>
      <description>ADC</description>
      <baseAddress>0x52028000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="ADC12_COMMON">
      <name>ADC12_COMMON_S</name>
      <baseAddress>0x52028308</baseAddress>
    </peripheral>
    <peripheral derivedFrom="DCMI">
      <name>DCMI_S</name>
      <description>DCMI</description>
      <baseAddress>0x5202c000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="PSSI">
      <name>PSSI_S</name>
      <description>PSSI</description>
      <baseAddress>0x5202c400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="USB_OTG_FS">
      <name>USB_OTG_FS_S</name>
      <description>USB_OTG_Core_register</description>
      <baseAddress>0x52040000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="AES">
      <name>AES_S</name>
      <description>AES hardware accelerator</description>
      <baseAddress>0x520c0000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="HASH">
      <name>HASH_S</name>
      <description>HASH</description>
      <baseAddress>0x520c0400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="RNG">
      <name>RNG_S</name>
      <description>RNG</description>
      <baseAddress>0x520c0800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="AES">
      <name>SAES_S</name>
      <description>AES hardware accelerator</description>
      <baseAddress>0x520c0c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="PKA">
      <name>PKA_S</name>
      <description>PKA</description>
      <baseAddress>0x520c2000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="OCTOSPIM">
      <name>OCTOSPIM_S</name>
      <description>Serial Peripheral Interface IO Manager</description>
      <baseAddress>0x520c4000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="OTFDEC1">
      <name>OTFDEC1_S</name>
      <baseAddress>0x520c5000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="OTFDEC1">
      <name>OTFDEC2_S</name>
      <baseAddress>0x520c5400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="SDMMC1">
      <name>SDMMC1_S</name>
      <description>Secure digital input/output Interface</description>
      <baseAddress>0x520c8000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="DLYB_SDMMC1">
      <name>DLYB_SDMMC1_S</name>
      <description>Delay Block DLYB</description>
      <baseAddress>0x520c8400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="DLYB_SDMMC1">
      <name>DLYB_SDMMC2_S</name>
      <description>Delay Block DLYB</description>
      <baseAddress>0x520c8800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="SDMMC1">
      <name>SDMMC2_S</name>
      <description>Secure digital input/output Interface</description>
      <baseAddress>0x520c8c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="DLYB_SDMMC1">
      <name>DLYB_OCTOSPI1_S</name>
      <description>Delay Block DLYB</description>
      <baseAddress>0x520cf000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="DLYB_SDMMC1">
      <name>DLYB_OCTOSPI2_S</name>
      <description>Delay Block DLYB</description>
      <baseAddress>0x520cf400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="FMC_Bank1_R">
      <name>FMC_Bank1_R_S</name>
      <description>Flexible Memory Controller</description>
      <baseAddress>0x520d0400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="FMC_Bank3_R">
      <name>FMC_Bank3_R_S</name>
      <description>Flexible Memory Controller Bank3</description>
      <baseAddress>0x520d0480</baseAddress>
    </peripheral>
    <peripheral derivedFrom="FMC_Bank1E_R">
      <name>FMC_Bank1E_R_S</name>
      <description>Flexible Memory Controller Bank1E</description>
      <baseAddress>0x520d0504</baseAddress>
    </peripheral>
    <peripheral derivedFrom="OCTOSPI1">
      <name>OCTOSPI1_S</name>
      <description>OCTO Serial Peripheral Interface</description>
      <baseAddress>0x520d1400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="OCTOSPI1">
      <name>OCTOSPI2_S</name>
      <description>OCTO Serial Peripheral Interface</description>
      <baseAddress>0x520d2400</baseAddress>
    </peripheral>
